from asyncio.log import logger
from unittest import case


slot_machine_value = {
    1: ("Бар", "Бар", "Бар"),
    2: ("Виноград", "Бар", "Бар"),
    3: ("Лимон", "Бар", "Бар"),
    4: ("Семь", "Бар", "Бар"),
    5: ("Бар", "Виноград", "Бар"),
    6: ("Виноград", "Виноград", "Бар"),
    7: ("Лимон", "Виноград", "Бар"),
    8: ("Семь", "Виноград", "Бар"),
    9: ("Бар", "Лимон", "Бар"),
    10: ("Виноград", "Лимон", "Бар"),
    11: ("Лимон", "Лимон", "Бар"),
    12: ("Семь", "Лимон", "Бар"),
    13: ("Бар", "Семь", "Бар"),
    14: ("Виноград", "Семь", "Бар"),
    15: ("Лимон", "Семь", "Бар"),
    16: ("Семь", "Семь", "Бар"),
    17: ("Бар", "Бар", "Виноград"),
    18: ("Виноград", "Бар", "Виноград"),
    19: ("Лимон", "Бар", "Виноград"),
    20: ("Семь", "Бар", "Виноград"),
    21: ("Бар", "Виноград", "Виноград"),
    22: ("Виноград", "Виноград", "Виноград"),
    23: ("Лимон", "Виноград", "Виноград"),
    24: ("Семь", "Виноград", "Виноград"),
    25: ("Бар", "Лимон", "Виноград"),
    26: ("Виноград", "Лимон", "Виноград"),
    27: ("Лимон", "Лимон", "Виноград"),
    28: ("Семь", "Лимон", "Виноград"),
    29: ("Бар", "Семь", "Виноград"),
    30: ("Виноград", "Семь", "Виноград"),
    31: ("Лимон", "Семь", "Виноград"),
    32: ("Семь", "Семь", "Виноград"),
    33: ("Бар", "Бар", "Лимон"),
    34: ("Виноград", "Бар", "Лимон"),
    35: ("Лимон", "Бар", "Лимон"),
    36: ("Семь", "Бар", "Лимон"),
    37: ("Бар", "Виноград", "Лимон"),
    38: ("Виноград", "Виноград", "Лимон"),
    39: ("Лимон", "Виноград", "Лимон"),
    40: ("Семь", "Виноград", "Лимон"),
    41: ("Бар", "Лимон", "Лимон"),
    42: ("Виноград", "Лимон", "Лимон"),
    43: ("Лимон", "Лимон", "Лимон"),
    44: ("Семь", "Лимон", "Лимон"),
    45: ("Бар", "Семь", "Лимон"),
    46: ("Виноград", "Семь", "Лимон"),
    47: ("Лимон", "Семь", "Лимон"),
    48: ("Семь", "Семь", "Лимон"),
    49: ("Бар", "Бар", "Семь"),
    50: ("Виноград", "Бар", "Семь"),
    51: ("Лимон", "Бар", "Семь"),
    52: ("Семь", "Бар", "Семь"),
    53: ("Бар", "Виноград", "Семь"),
    54: ("Виноград", "Виноград", "Семь"),
    55: ("Лимон", "Виноград", "Семь"),
    56: ("Семь", "Виноград", "Семь"),
    57: ("Бар", "Лимон", "Семь"),
    58: ("Виноград", "Лимон", "Семь"),
    59: ("Лимон", "Лимон", "Семь"),
    60: ("Семь", "Лимон", "Семь"),
    61: ("Бар", "Семь", "Семь"),
    62: ("Виноград", "Семь", "Семь"),
    63: ("Лимон", "Семь", "Семь"),
    64: ("Семь", "Семь", "Семь"),
}

class Baraban:
    balance = 0
    def check(value):
        combination = slot_machine_value[value]
        priz = 0  
        if value == 1 or value == 22 or value == 43:
            priz = 10
            Baraban.balance += priz
            return combination, priz
        if value == 64:
            priz = 50 
            Baraban.balance += priz
            return combination, priz
        
        print(Baraban.balance)
        return combination, priz





